In [5]:
import numpy as np
import pandas as pd

In [89]:
data = pd.read_excel("data/EmployeeDataToClean.xlsx")

In [7]:
car = pd.read_csv("data/car data.csv")

In [8]:
df = data.copy()

In [9]:
def volumne_check(df):
    return df.shape

In [10]:
def row_count(df):
    return df.shape[0]

In [11]:
def column_count(df):
    return df.shape[1]

In [12]:
def sample_data(df):
    return df.head()

In [13]:
def missing_value_perc(df):
    (df.isna().sum()/df.shape[0])*100

In [14]:
server = 'localhost'
port = 3306
user = 'root'
pas = 'root'

In [15]:
import pymysql
connection = pymysql.connect(host='localhost',
                             user='root',
                             password='root',
                             database='ksr_db')
cursor = connection.cursor()
cursor.execute("select * from car_tb")
k = cursor.fetchall()

In [16]:
pd.DataFrame(k).head(2)

      0     1     2     3      4       5       6       7  8
0  ritz  2014  3.35  5.59  27000  Petrol  Dealer  Manual  0
1   sx4  2013  4.75  9.54  43000  Diesel  Dealer  Manual  0

In [17]:
# !pip install mysql

In [18]:
sql_string = "mysql://root:root@localhost/ksr_db"

In [19]:
#!pip install mysql-connector-python

In [92]:
import mysql.connector
from sqlalchemy import create_engine
sql_engine = create_engine("mysql://root:root@localhost:3306/ksr_db")
query = "SELECT * FROM emp_mg"
df = pd.read_sql(query, sql_engine)
df.head(2)

   emp_id   name  manager
0       1  RAMAN      5.0
1       2  SARAB      5.0

In [22]:
from configparser import ConfigParser


def read_db_config(filename='config.ini', section='mysql'):
    parser = ConfigParser()
    parser.read(filename)
    db = {}
    if parser.has_section(section):
        items = parser.items(section)
        for item in items:
            db[item[0]] = item[1]
    else:
        raise Exception('{0} not found in the {1} file'.format(section, filename))

    return db

In [23]:
import os
os.listdir('data')

['.ipynb_checkpoints',
 'Bike_Data.xlsx',
 'car data.csv',
 'car.csv',
 'config.ini',
 'Custumer_Data.xlsx',
 'EmployeeDataToClean.xlsx',
 'Emp_Training_Data.xlsx',
 'Orders_Data.xlsx',
 'Orders_Data_2.xlsx',
 'superstore.xlsx',
 't_file.txt']

In [26]:
df.isna().count()

emp_id     6
name       6
manager    6
dtype: int64

In [28]:
df

   emp_id      name  manager
0       1     RAMAN      5.0
1       2     SARAB      5.0
2       3     PARAM      5.0
3       4     KAMAL      5.0
4       5  SANTHOSH      6.0
5       6    MAHESH      NaN

In [29]:
df.dropna(inplace=True)

In [30]:
df

   emp_id      name  manager
0       1     RAMAN      5.0
1       2     SARAB      5.0
2       3     PARAM      5.0
3       4     KAMAL      5.0
4       5  SANTHOSH      6.0

In [31]:
pd.to_numeric(df['manager'])

0    5.0
1    5.0
2    5.0
3    5.0
4    6.0
Name: manager, dtype: float64

In [33]:
df.select_dtypes(include=np.number)

   emp_id  manager
0       1      5.0
1       2      5.0
2       3      5.0
3       4      5.0
4       5      6.0

In [34]:
df.select_dtypes(include=np.number).columns

Index(['emp_id', 'manager'], dtype='object')

In [39]:
df.emp_id.dtype

dtype('int64')

In [38]:
df.columns

Index(['emp_id', 'name', 'manager'], dtype='object')

In [48]:
df.columns[df.dtypes == np.int64]

Index(['emp_id'], dtype='object')

In [66]:
df.dtypes

emp_id       int64
name        object
manager    float64
dtype: object

In [65]:
df.dtypes

emp_id       int64
name        object
manager    float64
dtype: object

In [76]:
df['emp_id'].dtype == np.int64

True

In [75]:
np.number(12)

TypeError: cannot create 'numpy.number' instances

In [52]:
'123'.isnumeric()

True

In [82]:
# import pandas as pd

# data = {
#     'Name': ['John', 'Anna', 'Peter', 'Linda'],
#     'Age': [28, 24, 35, 32],
#     'Salary': [3000, 3200, 4500, 3800]
# }

# df = pd.DataFrame(data)
# print(df.dtypes)
# numeric_df = df.apply(pd.to_numeric, errors='coerce')
# is_all_numeric = not numeric_df.isnull().values.any()
# print(is_all_numeric)

Name      object
Age        int64
Salary     int64
dtype: object
False

In [78]:
# import pandas as pd
# import numpy as np

# # Step 1: Create a DataFrame
# data = {
#     'Name': ['John', 'Anna', 'Peter', 'Linda'],
#     'Age': [28, 24, 35, 32],
#     'Salary': [3000, 3200, 4500, 3800]
# }

# df = pd.DataFrame(data)

# # Step 2: Check if All Columns are Numeric
# numeric_columns = df.select_dtypes(include=np.number).columns
# is_all_numeric = len(numeric_columns) == len(df.columns)

# print(is_all_numeric)

False

In [83]:
df.select_dtypes(include=np.number).columns

Index(['Age', 'Salary'], dtype='object')

In [84]:
df.select_dtypes(exclude=np.number).columns

Index(['Name'], dtype='object')

In [90]:
df=data.copy()

In [102]:
df

   emp_id      name  manager
0       1     RAMAN      5.0
1       2     SARAB      5.0
2       3     PARAM      5.0
3       4     KAMAL      5.0
4       5  SANTHOSH      6.0
5       6    MAHESH      NaN

In [119]:
pd.concat([df, pd.DataFrame([None])],ignore_index=True)

   emp_id      name  manager     0
0     1.0     RAMAN      5.0   NaN
1     2.0     SARAB      5.0   NaN
2     3.0     PARAM      5.0   NaN
3     4.0     KAMAL      5.0   NaN
4     5.0  SANTHOSH      6.0   NaN
5     6.0    MAHESH      NaN   NaN
6     NaN       NaN      NaN  None

In [120]:
df.dropna(how='all')

   emp_id      name  manager
0       1     RAMAN      5.0
1       2     SARAB      5.0
2       3     PARAM      5.0
3       4     KAMAL      5.0
4       5  SANTHOSH      6.0
5       6    MAHESH      NaN

In [121]:
df.dropna(how='any')

   emp_id      name  manager
0       1     RAMAN      5.0
1       2     SARAB      5.0
2       3     PARAM      5.0
3       4     KAMAL      5.0
4       5  SANTHOSH      6.0

In [123]:
df['name'] = df['name'].fillna('NA',inplace=True)

In [125]:
df['manager'] = df['manager'].fillna(df['manager'].mode(),inplace=True)